package mk.ukim.finki.dnic.mentalwellbeing.model;

import lombok.Getter;
import mk.ukim.finki.dnic.mentalwellbeing.model.enumeration.Category;
import mk.ukim.finki.dnic.mentalwellbeing.service.QuestionService;
import mk.ukim.finki.dnic.mentalwellbeing.service.TextService;
import org.springframework.stereotype.Component;

import javax.annotation.PostConstruct;

@Component
@Getter
public class DataHolder {

    private final TextService textService;
    private final QuestionService questionService;

    public DataHolder(TextService textService, QuestionService questionService) {
        this.textService = textService;
        this.questionService = questionService;
    }
    @PostConstruct
    public void initData(){
        Text t1 = new Text((long) 1,"Панични напади","Ова доживување најчесто е проследено со силни и забрзани отчукувања на срцето, трнење на рацете и стапалата (кај некого и згрчување на екстремитетите), препотување, гушење, мачнина, вртоглавица, конфузија и дезориентираност, што за оваа исплашена личност претставува доказ дека навистина се подготвува нешто лошо.\n" +
                "\n" + "Дијапазонот застрашувачки сценарија е широк и многу зависи од претходните искуства и креативноста на личноста, но најчесто тоа се паѓање во несвест, лудило и инфаркт, зашто телесните симптоми кои ги преживуваат луѓето во моменти на паника најмногу им наликуваат на споменатите нешта.\n" +
                "\n" + "Затоа луѓето вообичаено одат на лекарски прегледи за да откријат од што боледуваат, па кога лекарот ќе утврди дека нема физиолошки показатели на болеста, ги упатува кај психолог, психијатар, психотерапевт. Некогаш тоа го прави итната помош после еден или повеќе повици од страна на лицето кое доживеало напади на паника.",
                "https://neocortex.mk/wp-content/uploads/2020/07/anxiety.jpg", Category.ПАНИЧНИ_НАПАДИ);
        Text t2 = new Text((long)4, "Паника","Проблемите со паничните напади најчесто стартуваат во доцните тинејџерски години или во раната адолесценција, а почесто ги погодуваат жените отколку мажите.\n" +
                "\n" +
                "Фактори кои можат да го зголемат ризикот од развивање панични напади се:\n" +
                "\n" +
                "Семејна историја на панични напади или ментални нарушувања.\n" +
                "Неконтролиран, хроничен стрес.\n" +
                "Акутен стрес, доживеан поради некој важен животен настан, како смрт (особено неочекувана) или сериозна болест на близок човек.\n" +
                "Трауматичен настан, како на пример доживеан грабеж, сексуален напад итн. Тука влегуваат и траумите од раниот период на животот.\n" +
                "Пушење и прекумерна употреба на кофеин.","https://static.psycom.net/wp-content/uploads/2020/06/iStock-1136737354.jpg",Category.ПАНИЧНИ_НАПАДИ);
        Text t3= new Text((long)7, "Паника", "Главно се работи за личности кои се постојано во неизвесна мерка напнати ,често загрижени, со изразена потреба да се прикажат во добро светло и да им угодат на другите ,личности кој постојано внимаваат да не направат грешка ,пресовесни, пречувствителни препедантни, оние кои за себе велат дека ,,не трпат неправди,, како и оние кои се преоптоваруваат со обврски и со работа. Личностите со вака опишани карактерни ,,структури,, се многу поподложни на стрес, а познато е дека кај повеќето од оние кои страдаат од панично растројство постои присуство на препознатливи или скриени стресогени ситуации кои се предуслов за појава на растројство.","https://www.verywellmind.com/thmb/s-BHACV3qi1zF0rXrxhIRLtlo2M=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/top-symptoms-of-panic-attacks-2584270_FINAL-5bcdfd4d46e0fb0051228ee5.png", Category.ПАНИЧНИ_НАПАДИ);
        Text t4=new Text((long)2,"Анксиозност","Пациентите често се жалат и на варијација на тешкотии од физичка природа – замор, главоболки, гадење, повраќање, тресење на рацете и нозете, напнатост и стегање на мускулатурата, болки во мускулите, тешкотии при голтање и дишење, намалена концентрација, тресење, иритабилност, агитираност, препотување, немир, несоница, топли бранови, чешање, тешкотии да се контролира анксиозноста. Ако овие симптоми се постојано присутни во последните шест месеци, тогаш се работи за ГАП.\n" +
                "\n" +
                "Генерализираното анксиозно нарушување спаѓа во групата на анксиозни нарушувања и се карактеризира со ексцесивна, неконтролирана често пати ирационална грижа во секојдневното функционирање. Како што објаснува д-р Бјанка Чачев-Спанчевска, невропсихијатар во „Ре-Медика“, симптомите траат повеќе од 6 месеци и се присутни секојдневно. Таа вели дека прекумерната загриженост влијае на секојдневното функционирање, предизвикувајќи чувство на блиска пропаст.","https://runway.mk/media/1599809_20190207040220_5c5ba4b5b789689e85bb4f9djpeg_ls.jpg",Category.АНКСИОЗНОСТ);
        Text t5=new Text((long)5,"Анксиозност","Еден од најчестите симптоми пријавени од луѓе на кои им е дијагностицирана вознемиреност е тешкотијата да заспијат. Исто така, се сугерира дека луѓето кои во текот на детството доживеале несоница, имаат поголема веројатност да развијат вознемиреност во своите возрасни години. Овој симптом е често распространет кај луѓето кои имаат вознемиреност затоа што загриженоста често се јавува во текот на ноќта кога умот е помалку преокупиран, а недостатокот на сон што е резултат на загриженост предизвикува замор и раздразливост, што пак ги влошува ефектите од вознемиреност.","https://i1.wp.com/bitolanews.mk/wp-content/uploads/2020/07/vilavista-24.jpg?fit=1000%2C667&ssl=1",Category.АНКСИОЗНОСТ);
        Text t6=new Text((long)6,"Анксиозност","Анксиозноста е психолошко пореметување на 21 век.\n" +
                "\n" +
                "Тоа е постојано чувство на притисок, стегање, немокност за олабавување и немаже на животна радост. Грижа за своите здравствени, фамилијарни или финансиски проблеми, проблеми со пријателите, тешкотии на работното место. Анксиозноста е почесто нарушување одколку што си мислиме, состојба со која се справуваат над 40 милиони луѓе ширум светот.\n" +
                "Генерална карактерискика е загриженост, состојба на исчекување за нешто лошо да се случи состојба која по извесен период започнува да го попречува секојдневното живеење и функционирање.","https://www.verywellmind.com/thmb/aWn6ZNjJ6QBYTJOdbznxRyeZrGc=/1500x844/smart/filters:no_upscale()/social-anxiety-disorder-causes-3024749-5c3b8f7bc9e77c0001bffa28.png",Category.АНКСИОЗНОСТ);
        Text t7=new Text((long)3, "Самодоверба","Самодовербата е термин со широко значење, каде може да се каже дека некој едноставно верува во себе, или верува во своите способности, квалитети и расудувања, односно верува дека успешно може да се носи со секојдневните предизвици и барања.\n" +
                "\n" +
                "Уште повеќе, може да се поврзе со едно стабилно верување за личната вредност, дали и колку јас вредам. Не во пари, се разбира  Вклучително, подразбира и самопочит – лично верување дека јас заслужувам љубов, среќа и успех. Таа е базирана на минатите искуства и е ориентирана кон идните настани и перформанси на индивидуата.","https://www.tcnorth.com/wp-content/uploads/2017/03/iStock-615524918.jpg",Category.САМОДОВЕРБА);
        Text t8=new Text((long)8, "Самодоверба","КАКО ДО ПОГОЛЕМА САМОДОВЕРБА?\n" +
                "Сe чувствувате несигурно и имате чувство на помала вредност? Сакате да имате поисполнет живот од овој кој сега го живеете? Но, стравовите ве кочат и се откажувате од превземање било каков чекор кој ќе ве „извади“ од состојбата на несигурност. Се срамите и се плашите од тоа да бидете отфрлени и критикувани. Имате чувство на помала вредност и вина кога за тоа нема видливa причина? Колку пати самите за себе си кажавте дека сте бескорисни, безвредни, непривлечни, губитници? Колку себеси не се сакате, колкава лоша слика за себе имате? Емотивно сте ранливи, повлечени и се откажувате при првата пречка. Мислите дека не заслужувате ништо добро и дозволувате другите да ве обесхрабат. Не ги познавате своите приоритети и не знаете што сакате да работите. Што е причина за сето ова што ви се случува? Вашата ниска самодоверба! Сега е вистинско време да и кажете и доста е и збогум! Дозволете си самите во себе и во животот повеќе да уживате. Изградите живот токму онаков каков што сакате и бидете успешни и на приватен и на професионален план!","https://smallbusinessify.com/wp-content/uploads/2020/09/how-to-build-self-confidence-1024x751.jpg",Category.САМОДОВЕРБА);
        Text t9=new Text((long)9, "Самодоверба","Живеете еден безбеден живот и ви се чини дека ништо неможе да ве повреди. Вашата комфорна зона е вашето секојдневие, во кое сè правите по некој автоматизам. Престанете да чекате во животот да одите напред, а вие и понатака да се движите во својата зона на сигурност. Сè ви станало една здодевна, монотона навика. Престанете да играте улога на „жртва“. Животот ви започнува надвор од вашата комфорна зона. Излезете од неа и станете личност со висока самодоверба!\n","https://storage.googleapis.com/nextivawebsites-wordpressfiles-voip/var/www/virtual/nextiva.com/voip/2019/12/Increase-Confidence-Coach-Burt-1200x675.png",Category.САМОДОВЕРБА);

        Text t10=new Text((long)10,"Стрес","Стресот е како нашиот мозок и тело реагираат на барањата. Било каков вид на настан, без разлика дали е позитивен или негативен, може да предизвика стрес, а стресот е одреден дел од животот на секој човек. Стресот обично се смета за штетен, но всушност, не е целиот стрес лош. На пример, тоа може да ги мотивира луѓето да извршуваат тешки задачи.\n" +
                "\n" +
                "Стресот влијае многу повеќе од само на начинот на кој се чувствуваме. Може да влијае на нашето физичко здравје, исто така. Еден пример за ова е мигрена, или „стресни главоболки“. Стресот исто така може да влијае на нашиот апетит, сонот, да го зголеми крвниот притисок и многу повеќе. Долгорочен или хроничен стрес може да влијае на нашиот кардиоваскуларен, имунолошки, дигестивен и гастроинтестинален систем. За среќа, постојат многу различни начини на справување со стресот. Некои може да работат подобро за вас од другите, но сите тие можат да ни помогнат да се справиме со стресот на здрав начин.","https://medvisit.io/wp-content/uploads/2019/01/avoid-stress-scaled.jpg",Category.СТРЕС);
        Text t11=new Text((long)11,"Стрес","Модерниот начин на живеење подразбира сè повеќе стрес. Дали тој ќе биде поврзано со различните предизвици на работното место, со воспитувањето на децата, со некакви финансиски проблеми и неостварени желби, ако се работи за помлади лица, со училиштето, односите со блиските, љубовните ,,маки”, притисокот од средината итн. Да скратиме, со стресот се соочуваат сите возрасни групи и е буквално насекаде!\n" +
                "\n" +
                "Дополнително, новонастанатата ситуација со пандемијата, го направи контролирањето на стресот (што е многу значаен дел од она што се подразбира под добро одржувано ментално здравје) уште поголем предизвик.","https://cdn-prod.medicalnewstoday.com/content/images/articles/321/321450/stressed-woman-at-work.jpg",Category.СТРЕС);
        Text t12=new Text((long)12,"Стрес","Се смета дека стресот најчесто се јавува кај лицата на високи работни позиции. Но, мајките на мали деца знаат дека без разлика што наложува нивната работа, нивото на стрес се зголемува со бескрајните непроспани ноќи и грижата за децата.\n" +
                "\n" +
                "Подигнувањето на семејство е една од најблагодарните работи на светот – и морате да прифатите дека одвреме-навреме ќе ви биде тешко. Но што можете да направите вие за да си ги олесните работите?\n" +
                "\n" +
                "Добрата вест е дека и малите промени можат да направат големи разлики:\n" +
                "\n" +
                "Поспијте малку подолго – дури и „дремка“ од неколку минути во текот на денот може да ви помогне.\n" +
                "Јадете повеќе свежа храна – овошјето и салатата од свеж зеленчук не бараат голема подготовка, а може да се послужат со секој оброк.\n" +
                "Пијте повеќе вода – целете кон 1,500 мл. на ден плус дополнителни течности.\n" +
                "Додајте мала физичка активност на свеж воздух – само 30 минути брзо пешачење неколкупати неделно може да ви го зголеми енергетското ниво.\n" +
                "Размислете за дополнително внесување витамини/минерали.\n" +
                "Размислете за земање пробиотски додаток.\n" +
                "Секому му се познати овие промени во начинот на живот – но пробиотици? Како може тие да помогнат?","https://www.taylorintime.com/wp-content/uploads/2020/04/Stress-Liver-and-TCM.jpg",Category.СТРЕС);

        this.textService.save(t1);
        this.textService.save(t4);
        this.textService.save(t7);
        this.textService.save(t2);
        this.textService.save(t3);
        this.textService.save(t5);
        this.textService.save(t6);
        this.textService.save(t8);
        this.textService.save(t9);
        this.textService.save(t10);
        this.textService.save(t11);
        this.textService.save(t12);
        Question q1= new Question((long)1,"Како да бидам посконцетриран? Lorem ipsum dolor sit amet, consectetur adipiscing elit. \n" +
                "Mauris vulputate vehicula est, non consectetur metus \n" +
                "volutpat in. Lorem ipsum dolor sit amet, consectetur\n" +
                "adipiscing elit. Quisque auctor quis...\n","");
        Question q2 = new Question((long)2,"Кои се најдобри начини за справување со стрес? Lorem ipsum dolor sit amet, consectetur adipiscing elit. \n" +
                "Mauris vulputate vehicula est, non consectetur metus \n" +
                "volutpat in. Lorem ipsum dolor sit amet, consectetur\n" +
                "adipiscing elit. Quisque auctor quis...","");
        Question q3 = new Question((long)3,"Како да сопрам паничен напад? Lorem ipsum dolor sit amet, consectetur adipiscing elit. \n" +
                "Mauris vulputate vehicula est, non consectetur metus \n" +
                "volutpat in. Lorem ipsum dolor sit amet, consectetur\n" +
                "adipiscing elit. Quisque auctor quis...","");
        Question q4 = new Question((long)4,"Како да престанам со overthinking? Lorem ipsum dolor sit amet, consectetur adipiscing elit. \n" +
                "Mauris vulputate vehicula est, non consectetur metus \n" +
                "volutpat in. Lorem ipsum dolor sit amet, consectetur\n" +
                "adipiscing elit. Quisque auctor quis...","");
        Question q5 = new Question((long)5, "Како да се смирам кога сум под стрес? Lorem ipsum dolor sit amet, consectetur adipiscing elit. \n" +
                "Mauris vulputate vehicula est, non consectetur metus \n" +
                "volutpat in. Lorem ipsum dolor sit amet, consectetur\n" +
                "adipiscing elit. Quisque auctor quis...","");
        this.questionService.save(q1);
        this.questionService.save(q2);
        this.questionService.save(q3);
        this.questionService.save(q4);
        this.questionService.save(q5);

    }
}
